<?php
// /admn/common.php
declare(strict_types=1);

$TOPICS = [
  '43' => 'ყველა',
  '0' => 'თემის გარეშე',
  '1'  => 'იდენტიფიკაცია',
  '2'  => 'ოჯახი, ნათესავები',
  '3'  => 'წარმომავლობის სახელები',
  '4'  => 'სხეულის ნაწილები და შინაგანი ორგანოები',
  '5'  => 'ჯანმრთელობა, ჰიგიენა',
  '6'  => 'საცხოვრებელი გარემო',
  '7'  => 'განათლება, მეცნიერება',
  '8'  => 'საქმიანი ურთიერთობა',
  '9'  => 'პროფესიები, საქმიანობა',
  '10' => 'პიროვნული და საზოგადოებრივი ურთიერთობები',
  '11' => 'ყოველდღიურობა',
  '12' => 'კვება, საჭმელ-სასმელი',
  '13' => 'საყიდლები',
  '14' => 'თავისუფალი დრო, გართობა',
  '15' => 'უნარები, ჰობი',
  '16' => 'სპორტი',
  '17' => 'კულტურა და ხელოვნება',
  '18' => 'მგზავრობა, მოგზაურობა',
  '19' => 'ტრანსპორტი',
  '20' => 'მომსახურების სფერო',
  '21' => 'საგანგებო სიტუაცია',
  '22' => 'პოლიტიკა, სახელმწიფო მოწყობა და მართვა',
  '23' => 'რელიგია',
  '24' => 'საინფორმაციო საშუალებები',
  '25' => 'გარესამყარო',
  '26' => 'ფლორა',
  '27' => 'ფაუნა',
  '28' => 'გეოგრაფიული სახელები',
  '29' => 'სამეტყველო ინსტრუმენტები',
  '30' => 'ეტიკეტი',
  '31' => 'თვისებები და მახასიათებლები',
  '32' => 'ზოგადი ცნებები',
  '33' => 'ქმედება და მდგომარეობა, მიმართული მოძრაობა',
  '34' => 'გრძნობა-აღქმა, განწყობა',
  '35' => 'სხვადასხვა',
  '36' => 'პირთა სახელები და გვარები',
  '37' => 'ადამიანის გარეგნობა, თვისებები, ხასიათი',
  '38' => 'ავეჯი, ჭურჭელი, საოჯახო ნივთები',
  '39' => 'ტანსაცმელი, ფეხსაცმელი, აქსესუარები',
  '40' => 'კითხვითი სიტყვები',
  '41' => 'დრო, ადგილი, სივრცე, ზომა-წონა',
  '42' => 'რაოდენობა, რიგი, ნაწილი'
];

$PARTS_OF_SPEECH = [
  '13' => 'ყველა',
  '1'  => 'არსებითი სახელი',
  '2'  => 'ზედსართავი სახელი',
  '3'  => 'რიცხვითი სახელი',
  '4'  => 'ნაცვალსახელი',
  '5'  => 'ზმნა',
  '6'  => 'საწყისი',
  '7'  => 'მიმღეობა',
  '8'  => 'ზმნიზედა',
  '9'  => 'ნაწილაკი',
  '10' => 'კავშირი',
  '11' => 'თანდებული',
  '12' => 'შორისდებული'
];

$LEVEL = [
  'all' => 'ყველა',
  'A1'  => 'A1',
  'A2'  => 'A2',
  'A2+' => 'A2+',
  'B1'  => 'B1',
  'B2'  => 'B2',
  'B2+' => 'B2+',
  'C1'  => 'C1',
  'WL'  => 'WL',
];

function FormChars(string $data): string {
  return htmlspecialchars(trim($data), ENT_QUOTES, 'UTF-8');
}